#ifndef CONSTANTS_H
#define CONSTANTS_H

#define OK 0 //константа показывающая что всё верно
#define ERR_INPUT 1 // код ошибки показывающий ошибку ввода
#define ERR_RANGE 2 // код ошибки показывающий что введенный параметр выходит за определенный диапозон
#define ERR_ALLOCATION 3 // константа показывающая ошибку перевыделения памяти для массива
#define EMPTY_ARRAY 4 // константа показывающая что сформированный массив - пустой
#define ERR_LEN 5 //константа показывающая что позиция для вставки не входит в допустимый диапозон
#define ERR_SIZE 6 //код ошибки показывающий, что ввод количества элементов массива был не успешным

#endif // CONSTANTS_H
